<script setup>
import { ref } from 'vue';

const coffeeShops = ref([
  {
    id: 1,
    name: 'ใบพลู',
    description:'ร้านใบพลูเป็นร้านอาหารที่อยู่ในซอยที่ไม่มีร้านอาหารอื่นอยู่ ทำให้นั่งกินอาหาร 🍽 ฟังเพลงกันแบบชิลล์ ๆ 🎼 โดยไม่มีดนตรีจากร้านอื่นมารบกวน บรรยากาศภายในร้านก็ตกแต่งสบาย น่านั่งด้วยแสงสีวอร์มไลต์  แถมยังมีดนตรีสดตั้งแต่เวลา 20:30 - 22:30 น.' ,
    address: 'ซอย ชีกุน 2 ตำบลท่าวาสุกรี อำเภอ พระนครศรีอยุธยา จังหวัดพระนครศรีอยุธยา 13000' ,
    imageSrc:"https://www.thai2night.com/upload/shop/photo_cover/master/shop_shop_photo_cover_9480_1661584413.jpg",
  },
  {
    id: 2,
    name: 'The Story',
    description:' The Story รอให้คุณมาสัมผัสบรรยากาศใหม่ๆ สบายๆ ชิลๆ ทางร้านมีบริการทั้งโซนห้องแอร์และโซน outdoor และบรรยากาศ outdoor ก็มองเห็นโบราณสถาน บอกเลยว่าคุณจะได้อิ่มหนำกับ อาหารอร่อยๆ 🍽 และเพลงเพราะๆแนวยุค 90s อย่างเต็มที่ จากนักดนตรีผู้มีสามารถล้นเหลือ 🎼' ,
    address: '9/28-31 ประตูชัย เทศบาลนครพระนครศรีอยุธยา 13000' ,
    imageSrc:"https://www.thai2night.com/upload/shop/photo_cover/master/121491828_166303148482812_7661239556833659210_o.jpg",
  },
  {
    id: 3,
    name: 'Coffee House',
    description:'Coffee House เป็น ร้านอาหารใหญ่ใจกลางเมืองอยุธยา ให้อาหารมื้อค่ำของคุณเป็นมื้อพิเศษกับบรรยากาศสุดชิล ฟังดนตรีสดเพราะๆ อาหารอร่อย ถ่ายรูปสวย ร้านกว้างโปร่งโล่งนั่งสบาย รับจัดเลี้ยงพิเศษต่างๆ บอกเลยว่ามาครบจบที่นี่!' ,
    address: 'ถนน นเรศวร เทศบาลนครพระนครศรีอยุธยา 13000 ' ,
    imageSrc:"https://scontent.fcnx3-1.fna.fbcdn.net/v/t39.30808-6/244830243_196023469376022_1134264915972781726_n.jpg?_nc_cat=105&ccb=1-7&_nc_sid=5614bc&_nc_eui2=AeFyrK_zPoknL70bX7QKnZz4hmcIs9J2OiqGZwiz0nY6KuT9CXokoQCg-HVL7wGIpiEkX_nEOYtBfVUMGK_XrTwu&_nc_ohc=zP-6xaoOboUAX96Ic80&_nc_ht=scontent.fcnx3-1.fna&oh=00_AfCn5o663kRjkjtB4zKCbZlm7HoS-OPQsjGaa6X1P2lTHQ&oe=650069DF" ,
  },
  {
    id: 4,
    name: 'ค.แข็ง',
    description:'มาซอยนี้ต้อง ค.แข็ง ซอยฝรั่ง ซอยธกส แฮงค์เอ้าท์ที่ใหม่อยุธยา' ,
    address: 'ซอย ถนน นเรศวร ตำบลหัวรอ อำเภอ พระนครศรีอยุธยา จังหวัดพระนครศรีอยุธยา 13000 ประเทศไทย เทศบาลนครพระนครศรีอยุธยา 13000' ,
    imageSrc:"https://scontent.fcnx3-1.fna.fbcdn.net/v/t39.30808-6/334230613_1252064175705534_1870723179088691695_n.jpg?stp=cp6_dst-jpg&_nc_cat=101&ccb=1-7&_nc_sid=5614bc&_nc_eui2=AeHDBWEZ0rIiYEUBG1RBtQCFmgfYP9QY0XuaB9g_1BjRe9_vf8qA68E3t_Ix1AwS2Q7pCutljkD2tsL6odS6gFPv&_nc_ohc=b1FPXQ28YQEAX9DGeDm&_nc_ht=scontent.fcnx3-1.fna&oh=00_AfBvfwe4C3rXIFeZF3biauAN7qRBw5Hr0t1NbvQZNgj5Eg&oe=650042BB",
  },
  {
    id: 5,
    name: 'The Soi',
    description:'แฮงเอาท์ชิลๆในบรรยากาศสบายๆ' ,
    address: '14/9 ตำบล หัวรอ อำเภอ พระนครศรีอยุธยา จังหวัดพระนครศรีอยุธยา 13000 เทศบาลนครพระนครศรีอยุธยา 13000' ,
    imageSrc:"https://scontent.fcnx3-1.fna.fbcdn.net/v/t39.30808-6/277579126_3285447608404983_1717424494833679722_n.jpg?_nc_cat=106&ccb=1-7&_nc_sid=5614bc&_nc_eui2=AeH9c5ViULEnJe7Y7b54lq1Z0smo9T6__knSyaj1Pr_-SXimPFG59_Qz0DhVeZNLHwFRwOr3c-dE_-RSGSj1CaDg&_nc_ohc=Ok_HuWM4zhgAX-fxRwR&_nc_ht=scontent.fcnx3-1.fna&oh=00_AfArrZ_g0AVURGVJ_lNjtOVErvqIS_242M-LtKSLxx2M8Q&oe=6500E1C8",
  },
  {
    id: 6,
    name: 'Camping BAR Ayutthaya',
    description:'ร้านลับๆกลางทุ่งนามาๆ  โปรชั้นเพียบ Camping bar' ,
    address: 'เทศบาลนครพระนครศรีอยุธยา 13000' ,
    imageSrc:"https://scontent.fcnx3-1.fna.fbcdn.net/v/t39.30808-6/366741231_304581012102718_2666544644703561045_n.jpg?stp=cp6_dst-jpg&_nc_cat=109&ccb=1-7&_nc_sid=5614bc&_nc_eui2=AeEPBOj-4t_SlZ0KtdpxaX6yUlL0Uv8-H_RSUvRS_z4f9OnCkWE0bz_qs6r3C_vucc0HcOVJEexWVbBK-gln2ACB&_nc_ohc=SIegASjsk2kAX_UwtlF&_nc_ht=scontent.fcnx3-1.fna&oh=00_AfBfHAf5RkkpaJ2YOar9SjI5C3sFa9XYWzSUq11l4Mv0wg&oe=6501A664",
  },
]);



const reservation = ref(null);

const Table = (shop) => {
  const name = prompt('ชื่อ:');
  const phoneNumber = prompt('เบอร์โทร:');
  const date = prompt('วันที่:');
  const time = prompt('เวลา:');
  const tableCount = prompt('จำนวนโต๊ะ:');

  reservation.value = {
    name,
    phoneNumber,
    date,
    time,
    tableCount,
  };
};  
</script>

<template>
  <h1>จองโต๊ะร้านกาแฟ(หรือป่าวน้า)</h1><br>
  <div class="row">
    <div class="col-md-4" v-for="shop in coffeeShops" :key="shop.id">
      <div class="card">
        <img :src="shop.imageSrc" class="card-img-top"><br>
        <div class="card-body">
          <div class="card" >
          <h3 class="card-title">ร้าน {{ shop.name }}</h3><br>
          <h6 clss="card-title" style="font-size: small;">ที่อยู่ <br> {{ shop.address }}</h6><br>
          <p class="card-text">รายละเอียดร้าน <br> {{ shop.description }}</p>
        </div>
        </div>
              <button @click="Table(shop)">จองโต๊ะ !</button>
      </div>
    </div>
  </div>


    <div v-if="reservation">
      <h2>รายละเอียดการจอง</h2>
      <p>ชื่อ: {{ reservation.name }}</p>
      <p>เบอร์โทร: {{ reservation.phoneNumber }}</p>
      <p>วันที่: {{ reservation.date }}</p>
      <p>เวลา: {{ reservation.time }}</p>
      <p>จำนวนโต๊ะ: {{ reservation.tableCount }}</p>
    </div>

</template>





